title1 = "영화제목"
title2 = "개봉일"
title3 = "평점"
title4 = "관객수"
movie11 = "웡카"
movie12 = "24.01.31"
movie13 = 7.33
movie14 = 780000
movie21 = "외계+인 2부"
movie22 = "24.01.10"
movie23 = 8.22
movie24 = 1400000

arrange1="{0: ^13}|{1: ^9}|{2: ^12}|{3: ^9}".format(title1,title2,title3,title4)
arrange2="{0: ^15}|{1: ^12}|{2: ^14}|{3: >10}".format(movie11,movie12,movie13, '{0:,}'.format(movie14))
arrange3="{0: ^13}|{1: ^12}|{2: ^14}|{3: >10}".format(movie21,movie22,movie23,'{0:,}'.format(movie24))

print('-'*57)
print(arrange1)
print('-'*57)
print(arrange2)
print(arrange3)
print('-'*57)


# ---------------------------------------------------------
#     영화제목     |   개봉일   |     평점     |   관객수   
# ---------------------------------------------------------
#       웡카       |  24.01.31  |     7.33     |   780,000
#    외계+인 2부   |  24.01.10  |     8.22     | 1,400,000
# ---------------------------------------------------------
